# Экзамен по курсу "Аналитика данных на Python"

Этот тест проверит Ваши навыки работы с таблицами данных с помощью библиотек pandas и numpy. Задания делятся на простые (⭐️), средние (⭐️⭐️) и сложные (⭐️⭐️⭐️). Решение простых заданий, как правило, требует одной-двух операций с таблицами, тогда как для более сложных может потребоваться несколько последовательных преобразований данных.

##  Предыстория

Сегодня Ваш первый день работы в крупном интернет-магазине, который продаёт товары с доставкой по всему миру. Ваша первая задача – проанализировать базу данных покупок, совершённых в магазине за последние несколько лет. База содержит информацию об отдельных транзакциях, про каждую из которых известны номер инвойса (InvoiceNo), дата инвойса(InvoiceDate), код товара (StockCode), описание товара(Description), количество товара в транзакции (Quantity), стоимость единицы товара (UnitPrice), код покупателя (CustomerID), страна покупателя (Country).

База выгружена для Вас в формате CSV: файл [```online-retail.csv```](https://drive.google.com/file/d/1O1oJtpEu-u6s6xTu7seQfnNcQjYCt0GF/view?usp=sharing)

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

## ⭐️ Вопрос 1

Загрузите данные из файла online-retail.csv в переменную типа pandas DataFrame

Подсказка: Используйте функцию из библиотеки pandas

Какой символ-разделитель используется в этом файле?

* Запятая ","
* Двоеточие ":"
* Точка с запятой ";"
* Символ табуляции "tab"

#### Решение

In [2]:
df = pd.read_csv('online-retail.csv', sep=';', parse_dates=['InvoiceDate'], dayfirst=False)
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom

## ⭐️ Вопрос 2

Сколько строк в полученной таблице (не считая заголовков столбцов)?

#### Решение

In [3]:
df.shape[0]

541911

## ⭐️ Вопрос 3

Сколько столбцов в полученной таблице (не считая индекса)?

#### Решение

In [4]:
df.shape[1]

8

## ⭐️ Вопрос 4

Как называется столбец с самым коротким названием?

#### Решение

In [5]:
column_names = df.columns.to_numpy()
column_names[np.argsort([len(name) for name in column_names])][0]

'Country'

## ⭐️ Вопрос 5

В скольких столбцах встречаются пропущенные значения? (ответ - целое число)

#### Решение

In [6]:
(df.isna().sum() != 0).sum()

2

## ⭐️ Вопрос 6

Сколько пропущенных значений в столбце CustomerID? (ответ - целое число)

#### Решение

In [7]:
df.isna().sum()['CustomerID']

135080

## ⭐️⭐️ Вопрос 7

Посмотрим, данные за какой исторический период у нас есть. 

Данные за какой самый ранний и за какой самый поздний годы содержатся в датасете? В ответе укажите два целых числа через запятую.

#### Решение

In [8]:
f'{df["InvoiceDate"].min().year}, {df["InvoiceDate"].max().year}'

'2010, 2011'

## ⭐️ Вопрос 8

Каковы минимальная и максимальная цена товаров (UnitPrice)? Перечислите через запятую. Цена в этом задании может принимать отрицательные значения.

#### Решение

In [9]:
f'{df["UnitPrice"].min()}, {df["UnitPrice"].max()}'

'-11062.06, 38970.0'

## ⭐️ Вопрос 9

В таблице оказались товары с отрицательными ценами! Это явно какая-то ошибка. Какое описание (Description) у таких транзакций? Перечислите все варианты через запятую, отсортировав строки по алфавиту.

#### Решение

In [10]:
df[df['UnitPrice'] < 0]['Description'].sort_values().unique().tolist()

['Adjust bad debt']

## ⭐️ Вопрос 10

Поищем ещё возможные проблемы с данными. Как насчёт товаров с нулевыми ценами? 

Сколько в таблице транзакций с нулевой ценой? А с пропусками на месте цены? 

Перечислите два целых числа через запятую.

#### Решение

In [11]:
f'{df[df["UnitPrice"] == 0].shape[0]}, {df[df["UnitPrice"].isna()].shape[0]}'

'2515, 0'

## ⭐️⭐️ Вопрос 11

Для дальнейшего анализа поведения покупателей нам понадобится набор данных, в которых у каждой транзакции корректно указана цена, количество единиц товара (Quantity) и id покупателя (CustomerID). Удалите из таблицы все строки, в которых цена не превосходит 0 или пропущена, или количество единиц товара не превосходит 0 или пропущено, или в которых пропущен id покупателя. 

Сколько строк осталось?

#### Решение

In [12]:
df.isna().sum()

InvoiceNo           0
StockCode           0
Description      1455
Quantity            0
InvoiceDate         0
UnitPrice           0
CustomerID     135080
Country             0
dtype: int64

In [13]:
df = df[~((df['UnitPrice'] <= 0) | df['CustomerID'].isna() | (df['Quantity'] <= 0))]
df.shape[0]

397886

In [14]:
df.isna().sum()

InvoiceNo      0
StockCode      0
Description    0
Quantity       0
InvoiceDate    0
UnitPrice      0
CustomerID     0
Country        0
dtype: int64

## Внимание! 

### Везде далее мы работаем с очищенной таблицей, полученной в Вопросе 11.

## ⭐️⭐️ Вопрос 12

В таблице для каждой транзакции указаны цена за единицу товара (UnitPrice) и количество единиц товара (Quantity). Вычислите для каждой транзакции её **полную стоимость** и сохраните в новом столбце Price, который добавьте в таблицу. 

Каковы минимальная и максимальная полная стоимость транзакций? Перечислите через запятую, округлив до целых чисел.

#### Решение

In [15]:
df['Price'] = df['UnitPrice'] * df['Quantity']
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Price
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom,15.30
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom,22.00
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34

In [16]:
f'{int(df["Price"].min())}, {int(df["Price"].max())}'

'0, 168469'

## ⭐️⭐️ Вопрос 13

В нашей базе данных каждая покупка представлена одной или несколькими транзакциями. Покупка однозначно определяется своим номером инвойса (InvoiceNo). Транзакции, относящиеся к одной покупке, имеют один и тот же InvoiceNo. 

Стоимость всей покупки равна сумме полных стоимостей транзакций, входящих в неё. Найдите стоимости трёх самых дорогих покупок. Перечислите через запятую в порядке убывания, округлив до целых чисел.

#### Решение

In [17]:
', '.join(df.groupby('InvoiceNo').sum()['Price'].nlargest(3).apply(int).apply(str))

'168469, 77183, 38970'

## ⭐️⭐️ Вопрос 14

Какой товар составил наибольшую выручку? В ответе укажите описание товара (дословно строку из соответствующего поля в столбце Description).

#### Решение

In [18]:
stock_code = df.groupby('StockCode').sum()['Price'].nlargest(1).index[0]
df[df['StockCode'] == stock_code].reset_index().loc[0, 'Description']

'PAPER CRAFT , LITTLE BIRDIE'

## ⭐️⭐️ Вопрос 15

Создайте новую таблицу purchases, в которой каждая строка будет соответствовать отдельной покупке, со столбцами 
InvoiceNo, InvoiceDate, Price, CustomerID, Country.

Поскольку дата InvoiceDate может быть отличаться для разных транзакций внутри одной покупки, при группировке возьмите самую раннюю из дат. Также отсортируйте её по датам по возрастанию.

Учтите, что InvoiceDate — не уникальное поле, данные стоит дополнительно отсортировать по InvoiceNo, перед тем как брать первое значение группы.

Сколько получилось строк?

#### Решение

In [19]:
purchases = df.groupby('InvoiceNo').sum().drop(columns=['Quantity', 'UnitPrice']).reset_index()
purchases.head()

  InvoiceNo  CustomerID   Price
0    536365    124950.0  139.12
1    536366     35700.0   22.20
2    536367    156564.0  278.73
3    536368     52188.0   70.05
4    536369     13047.0   17.85

In [20]:
purchases['InvoiceDate'] = ''
purchases['Country'] = ''

for row in range(purchases.shape[0]):
    df_record = df[df['InvoiceNo'] == purchases.loc[row, 'InvoiceNo']].reset_index().iloc[0, :]
    purchases.at[row, 'InvoiceDate'] = df_record['InvoiceDate']
    purchases.at[row, 'Country'] = df_record['Country']

purchases['InvoiceDate'] = pd.to_datetime(purchases['InvoiceDate'])
purchases.head()

  InvoiceNo  CustomerID   Price         InvoiceDate         Country
0    536365    124950.0  139.12 2010-12-01 08:26:00  United Kingdom
1    536366     35700.0   22.20 2010-12-01 08:28:00  United Kingdom
2    536367    156564.0  278.73 2010-12-01 08:34:00  United Kingdom
3    536368     52188.0   70.05 2010-12-01 08:34:00  United Kingdom
4    536369     13047.0   17.85 2010-12-01 08:35:00  United Kingdom

In [21]:
purchases.shape[0]

18533

## ⭐️⭐️ Вопрос 16

Исследуем, растут или убывают покупки наших клиентов после их первой покупки на сайте. Найдите среднюю цену первых покупок клиентов: для каждого клиента возьмите его первую покупку и усредните эти значения. Найдите среднюю цену покупок в целом. Округлите эти числа до целых и перечислите в этом порядке через запятую.

\* При равных TimeStamp по покупкам первой считается покупка с меньшим InvoiceNo.

#### Решение

In [22]:
customer_ids = purchases['CustomerID'].unique()
first_purchase_prices = [
    purchases[purchases['CustomerID'] == customer_id]\
        .sort_values(['InvoiceDate', 'InvoiceNo'])\
        .reset_index()\
        .loc[0, 'Price']
    for customer_id in customer_ids
]
first_purchases_mean = int(np.mean(first_purchase_prices))
first_purchases_mean

483

In [23]:
total_purchase_mean = int(purchases['Price'].mean())
total_purchase_mean

480

In [24]:
f'{first_purchases_mean}, {total_purchase_mean}'

'483, 480'

## ⭐️⭐️⭐️ Вопрос 17

В какой день недели было наибольшее число покупок? В ответе укажите русское название дня недели, начинающееся с заглавной буквы.


Подсказка: 
* Преобразуйте тип данных в столбце InvoiceDate таблицы purchases из строк в datetime.
* Для каждой покупки вычислите день недели, в который она была совершена. Сохраните в новый столбец.
* Сгруппируйте таблицу по дням недели.

#### Решение

In [25]:
import locale
locale.setlocale(locale.LC_ALL, 'ru_RU.UTF-8')

'ru_RU.UTF-8'

In [26]:
purchases['Weekday'] = purchases['InvoiceDate'].dt.strftime('%A')
purchases.head()

  InvoiceNo  CustomerID   Price         InvoiceDate         Country Weekday
0    536365    124950.0  139.12 2010-12-01 08:26:00  United Kingdom   среда
1    536366     35700.0   22.20 2010-12-01 08:28:00  United Kingdom   среда
2    536367    156564.0  278.73 2010-12-01 08:34:00  United Kingdom   среда
3    536368     52188.0   70.05 2010-12-01 08:34:00  United Kingdom   среда
4    536369     13047.0   17.85 2010-12-01 08:35:00  United Kingdom   среда

In [27]:
purchases\
    .groupby('Weekday')\
    .count()['InvoiceNo']\
    .nlargest(1)\
    .index[0]\
    .capitalize()

'Четверг'

## ⭐️⭐️⭐️ Вопрос 18

В какой год и месяц выручка была максимальной?

Подсказка: 
* Преобразуйте тип данных в столбце InvoiceDate таблицы purchases из строк в datetime. 
* Для каждой покупки вычислите год и месяц, в которые она была совершена. Сохраните в новые столбцы.
* Сгруппируйте таблицу по новым столбцам

В ответе укажите два целых числа через запятую: год, месяц

#### Решение

In [28]:
purchases['Year'] = purchases['InvoiceDate'].dt.year
purchases['Month'] = purchases['InvoiceDate'].dt.month
purchases.head()

,InvoiceNo,CustomerID,Price,InvoiceDate,Country,Weekday,Year,Month
0,536365,124950.0,139.12,2010-12-01 08:26:00,United Kingdom,среда,2010,12
1,536366,35700.0,22.20,2010-12-01 08:28:00,United Kingdom,среда,2010,12
2,536367,156564.0,278.73,2010-12-01 08:34:00,United Kingdom,среда,2010,12
3,536368,52188.0,70.05,2010-12-01 08:34:00,United Kingdom,среда,2010,12
4,536369,13047.0,17.85,2010-12-01 08:35:00,United Kingdom,среда,2010,12

In [29]:
index = purchases.groupby(['Year', 'Month']).sum()['Price'].nlargest(1).index[0]
', '.join(np.array(index).astype('str'))

'2011, 11'

## ⭐️⭐️⭐️ Вопрос 19

Магазин продаёт товары покупателям из разных стран (Country). В какой стране был наибольший процентный рост месячных продаж, если сравнить март 2011 и сентябрь 2011? Сколько процентов составил этот рост? В расчёт брать только страны, в которых были ненулевые продажи в обоих этих месяцах. В ответе укажите через запятую название страны и целое число (процентный рост, округлённый до целого числа).

#### Решение

In [30]:
march_sales = purchases[(purchases['Year'] == 2011) & (purchases['Month'] == 3)]\
    .groupby('Country')\
    .sum()['Price']\
    .reset_index()
march_sales

            Country      Price
0         Australia   17223.99
1           Austria    1708.12
2           Belgium    3351.98
3            Canada     140.54
4   Channel Islands    3509.33
5            Cyprus     938.39
6           Denmark    3978.99
7              EIRE   21674.36
8           Finland    5936.82
9            France   14589.55
10          Germany   14392.69
11           Greece     387.31
12            Italy    1806.81
13            Japan      48.90
14      Netherlands   22416.49
15           Norway    1265.31
16           Poland     317.78
17         Portugal    2660.85
18            Spain    5363.15
19           Sweden    4720.58
20      Switzerland    1870.23
21   United Kingdom  467198.59

In [31]:
sept_sales = purchases[(purchases['Year'] == 2011) & (purchases['Month'] == 9)]\
    .groupby('Country')\
    .sum()['Price']\
    .reset_index()
sept_sales

                 Country       Price
0              Australia    5106.730
1                Belgium    4208.020
2        Channel Islands    1323.750
3                 Cyprus     196.350
4                Denmark    4570.160
5                   EIRE   40995.490
6                Finland    1105.450
7                 France   23428.040
8                Germany   18091.220
9                  Italy     279.800
10                 Japan     112.080
11           Netherlands   26937.260
12                Norway    8678.940
13                Poland     529.250
14              Portugal    1433.220
15                 Spain    5189.240
16                Sweden    4575.210
17           Switzerland    8284.860
18  United Arab Emirates    1013.040
19        United Kingdom  796780.272

In [32]:
country_sales = march_sales.merge(sept_sales, on='Country', suffixes=['Mar', 'Sep'])
country_sales['Growth'] = (((country_sales['PriceSep'] / country_sales['PriceMar']) - 1) * 100).apply(int)
largest = country_sales\
    .nlargest(1, columns=['Growth'])\
    .reset_index()\
    .loc[0, :]
f'{largest.loc["Country"]}, {largest["Growth"]}'

'Norway, 585'

## ⭐️⭐️⭐️ Вопрос 20

Большинство клиентов все свои покупки делают из одной и той же страны. Выясним, однако, насколько велика доля путешественников среди клиентов. 
Сколько клиентов сделали покупки по крайней мере из двух разных стран? (ответ - целое число)

#### Решение

In [33]:
country_counts = purchases.groupby('CustomerID')['Country'].nunique()
country_counts[country_counts > 1].shape[0]

30

## ⭐️⭐️⭐️ Вопрос 21

Мы запускаем в Италии рекомендательную систему "С этим товаром часто покупают...", и для этого хотим узнать, какие различные товары чаще всего встречаются в одной покупке из этой страны. Определите, какая пара различных товаров чаще всего встречается в различных покупках с ```Country=='Italy'```, и в скольких покупках это происходит. Одинаковые товары или нет, проверяйте по равенству поля Description. 

(ответ: название (Description) первого товара, название (Description) второго товара, целое число)

#### Решение

In [34]:
df_italy = df[df['Country'] == 'Italy']
df_italy.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Price
7214,537022,22791,T-LIGHT GLASS FLUTED ANTIQUE,12,2010-12-03 15:45:00,1.25,12725.0,Italy,15.0
7215,537022,21287,SCENTED VELVET LOUNGE CANDLE,12,2010-12-03 15:45:00,1.25,12725.0,Italy,15.0
7216,537022,79337,BLUE FLOCK GLASS CANDLEHOLDER,6,2010-12-03 15:45:00,1.65,12725.0,Italy,9.9
7217,537022,85111,SILVER GLITTER FLOWER VOTIVE HOLDER,12,2010-12-03 15:45:00,1.25,12725.0,Italy,15.0
7218,537022,85038,6 CHOCOLATE LOVE HEART T-LIGHTS,6,2010-12-03 15:45:00,2.10,12725.0,Italy,12.6

In [76]:
descriptions = df_italy['Description'].unique()

all_combinations = []
for description1 in descriptions:
    for description2 in descriptions:
        if description1 != description2:
            all_combinations.append((description1, description2))

len(all_combinations)

226100

In [81]:
column_names = ['Description_x', 'Description_x', 'Count']
df_pairs = pd.DataFrame(columns=column_names)

for combination in all_combinations:
    first_df = df_italy[df_italy['Description'] == combination[0]]
    second_df = df_italy[df_italy['Description'] == combination[1]]
    count = first_df\
        .merge(second_df, on='InvoiceNo', how='inner')\
        .groupby(['Description_x', 'Description_y'])\
        .size()\
        .to_frame()\
        .reset_index()
    count.columns = column_names
    df_pairs = pd.concat([df_pairs, count], axis=0)

df_pairs.head()

                  Description_x                        Description_x Count
0  T-LIGHT GLASS FLUTED ANTIQUE         SCENTED VELVET LOUNGE CANDLE     1
0  T-LIGHT GLASS FLUTED ANTIQUE        BLUE FLOCK GLASS CANDLEHOLDER     1
0  T-LIGHT GLASS FLUTED ANTIQUE  SILVER GLITTER FLOWER VOTIVE HOLDER     1
0  T-LIGHT GLASS FLUTED ANTIQUE      6 CHOCOLATE LOVE HEART T-LIGHTS     1
0  T-LIGHT GLASS FLUTED ANTIQUE              SET OF 6 T-LIGHTS SANTA     1

In [84]:
df_pairs['Count'] = df_pairs['Count'].astype(int)

In [91]:
most_sold_pair = df_pairs.nlargest(1, columns=['Count'])
', '.join(most_sold_pair.iloc[0, :].apply(str).values)

'TOY TIDY SPACEBOY, TOY TIDY PINK POLKADOT, 6'